ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/eusci_b.xml
<module id="eUSCI_B" HW_revision=""><register id="CTLW0" width="16" offset="0x0" internal="0" description="eUSCI_Bx Control Word Register 0"><bitfield id="SWRST" description="Software reset enable&#13;&#10;Modify only when UCSWRST = 1." begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="SWRST__0" value="0" description="Disabled. eUSCI_B reset released for operation"/><bitenum id="SWRST__1" value="1" description="Enabled. eUSCI_B logic held in reset state"/></bitfield><bitfield id="TXSTT" description="Transmit START condition in master mode" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="TXSTT__0" value="0" description="Do not generate START condition"/><bitenum id="TXSTT__1" value="1" description="Generate START condition"/></bitfield><bitfield id="TXSTP" description="Transmit STOP condition in master mode" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="TXSTP__0" value="0" description="No STOP generated"/><bitenum id="TXSTP__1" value="1" description="Generate STOP"/></bitfield><bitfield id="TXNACK" description="Transmit a NACK" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="TXNACK__0" value="0" description="Acknowledge normally"/><bitenum id="TXNACK__1" value="1" description="Generate NACK"/></bitfield><bitfield id="TR" description="Transmitter/receiver" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="TR__0" value="0" description="Receiver"/><bitenum id="TR__1" value="1" description="Transmitter"/></bitfield><bitfield id="TXACK" description="Transmit ACK condition in slave mode with enabled address mask " begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="TXACK__0" value="0" description="Do not acknowledge the slave address"/><bitenum id="TXACK__1" value="1" description="Acknowledge the slave address"/></bitfield><bitfield id="SSEL" description="eUSCI_B clock source select" begin="7" end="6" width="2" rwaccess="R/W"><bitenum id="SSEL__0" value="0" description="UCLKI"/><bitenum id="SSEL__1" value="1" description="ACLK"/><bitenum id="SSEL__2" value="2" description="SMCLK"/><bitenum id="SSEL__3" value="3" description="SMCLK"/></bitfield><bitfield id="SYNC" description="Synchronous mode enable. For eUSCI_B always read and write as 1." begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="SYNC__0" value="0" description="Asynchronous mode"/><bitenum id="SYNC__1" value="1" description="Synchronous mode"/></bitfield><bitfield id="MODE" description="eUSCI_B mode" begin="10" end="9" width="2" rwaccess="R/W"><bitenum id="MODE__0" value="0" description="3-pin SPI"/><bitenum id="MODE__1" value="1" description="4-pin SPI (master or slave enabled if STE = 1)"/><bitenum id="MODE__2" value="2" description="4-pin SPI (master or slave enabled if STE = 0)"/><bitenum id="MODE__3" value="3" description="I2C mode"/></bitfield><bitfield id="MST" description="Master mode select" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="MST__0" value="0" description="Slave mode"/><bitenum id="MST__1" value="1" description="Master mode"/></bitfield><bitfield id="MM" description="Multi-master environment select.&#13;&#10;Modify only when UCSWRST = 1." begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="MM__0" value="0" description="Single master environment"/><bitenum id="MM__1" value="1" description="Multi-master environment"/></bitfield><bitfield id="SLA10" description="Slave addressing mode select" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="SLA10__0" value="0" description="Address slave with 7-bit address"/><bitenum id="SLA10__1" value="1" description="Address slave with 10-bit address"/></bitfield><bitfield id="A10" description="Own addressing mode select.&#13;&#10;Modify only when UCSWRST = 1." begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="A10__0" value="0" description="Own address is a 7-bit address"/><bitenum id="A10__1" value="1" description="Own address is a 10-bit address"/></bitfield></register><register id="CTLW1" width="16" offset="0x2" internal="0" description="eUSCI_Bx Control Word Register 1"><bitfield id="GLIT" description="Deglitch time" begin="1" end="0" width="2" rwaccess="R/W"><bitenum id="GLIT__0" value="0" description="50 ns"/><bitenum id="GLIT__1" value="1" description="25 ns"/><bitenum id="GLIT__2" value="2" description="12.5 ns"/><bitenum id="GLIT__3" value="3" description="6.25 ns"/></bitfield><bitfield id="ASTP" description="Automatic STOP condition generation" begin="3" end="2" width="2" rwaccess="R/W"><bitenum id="ASTP__0" value="0" description="No automatic STOP generation"/><bitenum id="ASTP__1" value="1" description="UCBCNTIFG is set with the byte counter reaches the threshold de"/><bitenum id="ASTP__2" value="2" description="A STOP condition is generated automatically after the byte coun"/></bitfield><bitfield id="SWACK" description="Using this bit it is possible to select, whether the eUSCI_B mo" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="SWACK__0" value="0" description="The address acknowledge of the slave is controlled by the eUSCI"/><bitenum id="SWACK__1" value="1" description="The user needs to trigger the sending of the address ACK by iss"/></bitfield><bitfield id="STPNACK" description="The UCSTPNACK bit allows to make the eUSCI_B master acknowledge" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="STPNACK__0" value="0" description="Send a non-acknowledge before the STOP condition as a master re"/><bitenum id="STPNACK__1" value="1" description="All bytes are acknowledged by the eUSCI_B when configured as ma"/></bitfield><bitfield id="CLTO" description="Clock low timeout select.&#13;&#10;Modify only when UCSWRST = 1." begin="7" end="6" width="2" rwaccess="R/W"><bitenum id="CLTO__0" value="0" description="Disable clock low timeout counter"/><bitenum id="CLTO__1" value="1" description="135 000 SYSCLK cycles (approximately 28 ms)"/><bitenum id="CLTO__2" value="2" description="150 000 SYSCLK cycles (approximately 31 ms)"/><bitenum id="CLTO__3" value="3" description="165 000 SYSCLK cycles (approximately 34 ms)"/></bitfield><bitfield id="ETXINT" description="Early UCTXIFG0" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="ETXINT__0" value="0" description="UCTXIFGx is set after an address match with UCxI2COAx and the d"/><bitenum id="ETXINT__1" value="1" description="UCTXIFG0 is set for each START condition"/></bitfield></register><register id="BRW" width="16" offset="0x6" internal="0" description="eUSCI_Bx Baud Rate Control Word Register"><bitfield id="BR" description="Bit clock prescaler.&#13;&#10;Modify only when UCSWRST = 1." begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="STATW" width="16" offset="0x8" internal="0" description="eUSCI_Bx Status Register"><bitfield id="BBUSY" description="Bus busy" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="BBUSY__0" value="0" description="Bus inactive"/><bitenum id="BBUSY__1" value="1" description="Bus busy"/></bitfield><bitfield id="GC" description="General call address received" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="GC__0" value="0" description="No general call address received"/><bitenum id="GC__1" value="1" description="General call address received"/></bitfield><bitfield id="SCLLOW" description="SCL low" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="SCLLOW__0" value="0" description="SCL is not held low"/><bitenum id="SCLLOW__1" value="1" description="SCL is held low"/></bitfield><bitfield id="BCNT" description="Hardware byte counter value" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="TBCNT" width="16" offset="0xA" internal="0" description="eUSCI_Bx Byte Counter Threshold Register"><bitfield id="TBCNT" description="The byte counter threshold value is used to set the number of I" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="RXBUF" width="16" offset="0xC" internal="0" description="eUSCI_Bx Receive Buffer Register"><bitfield id="RXBUF" description="The receive-data buffer is user accessible and contains the las" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="TXBUF" width="16" offset="0xE" internal="0" description="eUSCI_Bx Transmit Buffer Register"><bitfield id="TXBUF" description="The transmit data buffer is user accessible and holds the data " begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="I2COA0" width="16" offset="0x14" internal="0" description="eUSCI_Bx I2C Own Address 0 Register"><bitfield id="I2COA0" description="I2C own address" begin="9" end="0" width="10" rwaccess="R/W"/><bitfield id="OAEN" description="Own Address enable register" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="OAEN__0" value="0" description="The slave address defined in I2COA0 is disabled"/><bitenum id="OAEN__1" value="1" description="The slave address defined in I2COA0 is enabled"/></bitfield><bitfield id="GCEN" description="General call response enable" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="GCEN__0" value="0" description="Do not respond to a general call"/><bitenum id="GCEN__1" value="1" description="Respond to a general call"/></bitfield></register><register id="I2COA1" width="16" offset="0x16" internal="0" description="eUSCI_Bx I2C Own Address 1 Register"><bitfield id="I2COA1" description="I2C own address" begin="9" end="0" width="10" rwaccess="R/W"/><bitfield id="OAEN" description="Own Address enable register" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="OAEN__0" value="0" description="The slave address defined in I2COA1 is disabled"/><bitenum id="OAEN__1" value="1" description="The slave address defined in I2COA1 is enabled"/></bitfield></register><register id="I2COA2" width="16" offset="0x18" internal="0" description="eUSCI_Bx I2C Own Address 2 Register"><bitfield id="I2COA2" description="I2C own address" begin="9" end="0" width="10" rwaccess="R/W"/><bitfield id="OAEN" description="Own Address enable register" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="OAEN__0" value="0" description="The slave address defined in I2COA2 is disabled"/><bitenum id="OAEN__1" value="1" description="The slave address defined in I2COA2 is enabled"/></bitfield></register><register id="I2COA3" width="16" offset="0x1A" internal="0" description="eUSCI_Bx I2C Own Address 3 Register"><bitfield id="I2COA3" description="I2C own address" begin="9" end="0" width="10" rwaccess="R/W"/><bitfield id="OAEN" description="Own Address enable register" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="OAEN__0" value="0" description="The slave address defined in I2COA3 is disabled"/><bitenum id="OAEN__1" value="1" description="The slave address defined in I2COA3 is enabled"/></bitfield></register><register id="ADDRX" width="16" offset="0x1C" internal="0" description="eUSCI_Bx I2C Received Address Register"><bitfield id="ADDRX" description="Received Address Register" begin="9" end="0" width="10" rwaccess="R/W"/></register><register id="ADDMASK" width="16" offset="0x1E" internal="0" description="eUSCI_Bx I2C Address Mask Register"><bitfield id="ADDMASK" description="Address Mask Register" begin="9" end="0" width="10" rwaccess="R/W"/></register><register id="I2CSA" width="16" offset="0x20" internal="0" description="eUSCI_Bx I2C Slave Address Register"><bitfield id="I2CSA" description="I2C slave address" begin="9" end="0" width="10" rwaccess="R/W"/></register><register id="IE" width="16" offset="0x2A" internal="0" description="eUSCI_Bx Interrupt Enable Register"><bitfield id="RXIE0" description="Receive interrupt enable 0" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="RXIE0__0" value="0" description="Interrupt disabled"/><bitenum id="RXIE0__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="TXIE0" description="Transmit interrupt enable 0" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="TXIE0__0" value="0" description="Interrupt disabled"/><bitenum id="TXIE0__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="STTIE" description="START condition interrupt enable" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="STTIE__0" value="0" description="Interrupt disabled"/><bitenum id="STTIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="STPIE" description="STOP condition interrupt enable" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="STPIE__0" value="0" description="Interrupt disabled"/><bitenum id="STPIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="ALIE" description="Arbitration lost interrupt enable" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="ALIE__0" value="0" description="Interrupt disabled"/><bitenum id="ALIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="NACKIE" description="Not-acknowledge interrupt enable" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="NACKIE__0" value="0" description="Interrupt disabled"/><bitenum id="NACKIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="BCNTIE" description="Byte counter interrupt enable" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="BCNTIE__0" value="0" description="Interrupt disabled"/><bitenum id="BCNTIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="CLTOIE" description="Clock low timeout interrupt enable" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="CLTOIE__0" value="0" description="Interrupt disabled"/><bitenum id="CLTOIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="RXIE1" description="Receive interrupt enable 1" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="RXIE1__0" value="0" description="Interrupt disabled"/><bitenum id="RXIE1__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="TXIE1" description="Transmit interrupt enable 1" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="TXIE1__0" value="0" description="Interrupt disabled"/><bitenum id="TXIE1__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="RXIE2" description="Receive interrupt enable 2" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="RXIE2__0" value="0" description="Interrupt disabled"/><bitenum id="RXIE2__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="TXIE2" description="Transmit interrupt enable 2" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="TXIE2__0" value="0" description="Interrupt disabled"/><bitenum id="TXIE2__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="RXIE3" description="Receive interrupt enable 3" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="RXIE3__0" value="0" description="Interrupt disabled"/><bitenum id="RXIE3__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="TXIE3" description="Transmit interrupt enable 3" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="TXIE3__0" value="0" description="Interrupt disabled"/><bitenum id="TXIE3__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="BIT9IE" description="Bit position 9 interrupt enable" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="BIT9IE__0" value="0" description="Interrupt disabled"/><bitenum id="BIT9IE__1" value="1" description="Interrupt enabled"/></bitfield></register><register id="IFG" width="16" offset="0x2C" internal="0" description="eUSCI_Bx Interrupt Flag Register"><bitfield id="RXIFG0" description="eUSCI_B receive interrupt flag 0" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="RXIFG0__0" value="0" description="No interrupt pending"/><bitenum id="RXIFG0__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="TXIFG0" description="eUSCI_B transmit interrupt flag 0" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="TXIFG0__0" value="0" description="No interrupt pending"/><bitenum id="TXIFG0__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="STTIFG" description="START condition interrupt flag" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="STTIFG__0" value="0" description="No interrupt pending"/><bitenum id="STTIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="STPIFG" description="STOP condition interrupt flag" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="STPIFG__0" value="0" description="No interrupt pending"/><bitenum id="STPIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="ALIFG" description="Arbitration lost interrupt flag" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="ALIFG__0" value="0" description="No interrupt pending"/><bitenum id="ALIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="NACKIFG" description="Not-acknowledge received interrupt flag" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="NACKIFG__0" value="0" description="No interrupt pending"/><bitenum id="NACKIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="BCNTIFG" description="Byte counter interrupt flag" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="BCNTIFG__0" value="0" description="No interrupt pending"/><bitenum id="BCNTIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="CLTOIFG" description="Clock low timeout interrupt flag" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="CLTOIFG__0" value="0" description="No interrupt pending"/><bitenum id="CLTOIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="RXIFG1" description="eUSCI_B receive interrupt flag 1" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="RXIFG1__0" value="0" description="No interrupt pending"/><bitenum id="RXIFG1__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="TXIFG1" description="eUSCI_B transmit interrupt flag 1" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="TXIFG1__0" value="0" description="No interrupt pending"/><bitenum id="TXIFG1__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="RXIFG2" description="eUSCI_B receive interrupt flag 2" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="RXIFG2__0" value="0" description="No interrupt pending"/><bitenum id="RXIFG2__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="TXIFG2" description="eUSCI_B transmit interrupt flag 2" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="TXIFG2__0" value="0" description="No interrupt pending"/><bitenum id="TXIFG2__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="RXIFG3" description="eUSCI_B receive interrupt flag 3" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="RXIFG3__0" value="0" description="No interrupt pending"/><bitenum id="RXIFG3__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="TXIFG3" description="eUSCI_B transmit interrupt flag 3" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="TXIFG3__0" value="0" description="No interrupt pending"/><bitenum id="TXIFG3__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="BIT9IFG" description="Bit position 9 interrupt flag" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="BIT9IFG__0" value="0" description="No interrupt pending"/><bitenum id="BIT9IFG__1" value="1" description="Interrupt pending"/></bitfield></register><register id="IV" width="16" offset="0x2E" internal="0" description="eUSCI_Bx Interrupt Vector Register"><bitfield id="IV" description="eUSCI_B interrupt vector value" begin="15" end="0" width="16" rwaccess="R/W"><bitenum id="IV__0" value="0" description="No interrupt pending"/><bitenum id="IV__2" value="2" description="Interrupt Source: Arbitration lost; Interrupt Flag: UCALIFG; In"/><bitenum id="IV__4" value="4" description="Interrupt Source: Not acknowledgment; Interrupt Flag: UCNACKIFG"/><bitenum id="IV__6" value="6" description="Interrupt Source: Start condition received; Interrupt Flag: UCS"/><bitenum id="IV__8" value="8" description="Interrupt Source: Stop condition received; Interrupt Flag: UCST"/><bitenum id="IV__16" value="10" description="Interrupt Source: Slave 3 Data received; Interrupt Flag: UCRXIF"/><bitenum id="IV__18" value="12" description="Interrupt Source: Slave 3 Transmit buffer empty; Interrupt Flag"/><bitenum id="IV__20" value="14" description="Interrupt Source: Slave 2 Data received; Interrupt Flag: UCRXIF"/><bitenum id="IV__22" value="16" description="Interrupt Source: Slave 2 Transmit buffer empty; Interrupt Flag"/><bitenum id="IV__24" value="18" description="Interrupt Source: Slave 1 Data received; Interrupt Flag: UCRXIF"/><bitenum id="IV__32" value="20" description="Interrupt Source: Slave 1 Transmit buffer empty; Interrupt Flag"/><bitenum id="IV__34" value="22" description="Interrupt Source: Data received; Interrupt Flag: UCRXIFG0"/><bitenum id="IV__36" value="24" description="Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIF"/><bitenum id="IV__38" value="26" description="Interrupt Source: Byte counter zero; Interrupt Flag: UCBCNTIFG"/><bitenum id="IV__40" value="28" description="Interrupt Source: Clock low timeout; Interrupt Flag: UCCLTOIFG"/><bitenum id="IV__48" value="30" description="Interrupt Source: Nineth bit position; Interrupt Flag: UCBIT9IF"/></bitfield></register></module>